# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [48]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [51]:
arr1 = np.random.randint(1, high=5, size=100, dtype="l")
arr2 = np.random.randint(1, high=4, size=100, dtype="l")
arr3 = np.random.randint(10000, high=300001, size=100, dtype="l")

ser1 = pd.Series(arr1)
ser2 = pd.Series(arr2)
ser3 = pd.Series(arr3)

### Step 3. Let's create a DataFrame by joinning the Series by column

In [54]:
joindf = pd.concat([ser1, ser2, ser3], axis=1)
joindf.head()

   0  1       2
0  1  2   58583
1  3  1  142339
2  4  2  207313
3  1  3  288074
4  2  2  269326

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [72]:
joindf.rename(columns={0:'bedrs', 1:'bathrs', 2:'price_sqr_meter'}, inplace=True)
joindf.head()

   bedrs  bathrs  price_sqr_meter
0      1       2            58583
1      3       1           142339
2      4       2           207313
3      1       3           288074
4      2       2           269326

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [79]:
bigcolumn = pd.concat([ser1,ser2,ser3], axis=0)
bigcolumn.head()

bigcolumn.to_frame()

         0
0        1
1        3
2        4
3        1
4        2
..     ...
95  211357
96  226693
97   93495
98  115106
99  115062

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [85]:
bigcolumn.shape

(300,)

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [87]:
bigcolumn.reset_index(drop=True, inplace=True)

In [93]:
bigcolumn.to_frame()

          0
0         1
1         3
2         4
3         1
4         2
..      ...
295  211357
296  226693
297   93495
298  115106
299  115062

[300 rows x 1 columns]